import { Box, Paper, Typography } from "@mui/material";

const AboutUsPage = () => {
  const aboutUsText = [
    `وجود داشتن کتاب‌های آزاد تحت لایسنس‌های آزاد اهمیت زیادی دارد و ما برای آزادی دانش فعالیت می‌کنیم. وجود این کتاب‌ها به ما این امکان را می‌دهند که به راحتی به اطلاعات و دانش دسترسی پیدا کنیم و آن‌ها را با دیگران به اشتراک بگذاریم. وقتی کتاب‌ها آزاد هستند، هر کسی می‌تواند آن‌ها را ویرایش کند، به‌روز کند یا حتی به زبان‌های مختلف ترجمه کند.`,
    `ما معتقدیم که دانش آزاد حق همه است و برای تحقق این هدف، به مشارکت شما نیاز داریم. بیایید با هم از کتاب‌های آزاد حمایت کنیم و به یکدیگر کمک کنیم تا به دانش بیشتری دست پیدا کنیم. هر کدام از ما می‌توانیم با به اشتراک گذاشتن کتاب‌ها، نوشتن نقد و بررسی یا حتی ترجمه آثار، نقش مهمی در این حرکت ایفا کنیم.`,
    `بیایید دست در دست هم، دنیای یادگیری را برای همه آسان‌تر کنیم. `,
    `شعار ما: "دانش آزاد، حق همه!"`,
  ];

  return (
    <Box
      sx={{
        m: "auto",
        p: 10,
        maxWidth: { s: 345, md: 700, lg: 1200 },
      }}
    >
      <Typography variant="h3" sx={{ mb: 10 }}>
        درباره ما
      </Typography>
      <Paper sx={{ p: 5 }}>
        {aboutUsText.map((text, index) => (
          <Typography variant="body1" key={index} sx={{mb:5}}>
            {text}
          </Typography>
        ))}
      </Paper>
    </Box>
  );
};

export default AboutUsPage;
